<template>
  <div class="container">
    <h1>Обучение</h1>

    <h2 class="ask-header">
      Хотите освоить самую востребованную профессию и зарабатывать на этом?
    </h2>

    <p class="welcome">
      Приглашаю Вас на базовый курс, где за 2 дня вы получите максимум знаний и практики, чтобы
      стать профессионалом в сфере реконструкции волос!
    </p>

    <h2 class="what-expect header-two">Что вас ждет?</h2>

    <h3 class="header-three">День 1:</h3>
    <ul>
      <li>Глубокое погружение в трихологию: от строения волоса до причин выпадения.</li>
      <li>
        Подробный разбор горячих (кератин, ботокс, нанопластика) и холодных техник реконструкции:
        состав, реакции, сравнение, секреты техник.
      </li>
      <li>Все о пилингах для кожи головы: диагностика, виды, техники, функции.</li>
      <li>
        Практика на 2 моделях: многоступенчатое холодное восстановление, уход, пилинг с трихоскопом.
      </li>
    </ul>

    <h3 class="header-three">День 2:</h3>
    <ul>
      <li>Закрепление пройденного материала и упражнения по подбору процедур.</li>
      <li>Нюансы сочетания процедур с окрашиванием.</li>
      <li>Обзор лучших продуктов и секреты успешного старта.</li>
      <li>Все о продвижении в Instagram и привлечении клиентов!</li>
      <li>
        Практика на 2 моделях: постановка руки, отработка техник, кератин, нанопластика, ботокс +
        подложка, подравнивание кончиков.
      </li>
    </ul>

    <h3 class="header-three">Вы научитесь:</h3>
    <ul>
      <li>Проводить точную диагностику волос и кожи головы.</li>
      <li>Подбирать оптимальные процедуры для каждого клиента.</li>
      <li>Работать с разными типами волос и степенями повреждения.</li>
      <li>Добиваться идеального результата и долгого эффекта.</li>
      <li>Продвигать свои услуги в Instagram и привлекать клиентов.</li>
    </ul>

    <h3 class="header-three">Ваши преимущества:</h3>
    <ul>
      <li>Сертификат мастера по окончании курса.</li>
      <li>Методический материал со всей необходимой информацией.</li>
      <li>Практика под моим руководством.</li>
      <li>Поддержка после обучения.</li>
    </ul>

    <h2 class="price-header header-two">Стоимость: 25 000 рублей. Возможна рассрочка!</h2>

    <p>
      Не упустите свой шанс стать востребованным мастером!<br />Записывайтесь прямо сейчас в лс или
      ватсапп/тг —
      <a class="phone-number" href="tel:+79600872086"> 8 960 087-2086 </a>
    </p>
  </div>
</template>

<script setup lang="ts">
import { onMounted } from 'vue'

onMounted(() => {
  document.title = 'Обучение'
})
</script>

<style scoped>
.container {
  max-width: 1100px;
  padding: 0 15px 15px 15px;
  margin: 0 auto;
}

.header-two {
  margin: 20px 0;
}

.header-three {
  margin-top: 20px;
}

.phone-number {
  text-decoration: underline;
}

.what-expect {
  margin-top: 15px;
}

.welcome {
  margin-top: 5px;
}

.price-header {
  margin: 15px 0;
}

.ask-header,
.price-header {
  line-height: 1.2;
}

.ask-header {
  margin-top: 10px;
}

/* Mobile devices */
@media (max-width: 450px) {
  .welcome {
    margin-top: 10px;
  }

  .price-header {
    margin: 15px 0;
    line-height: 1.2;
  }
}
</style>
