<script setup lang="ts">
import TablePrices from '@/components/TablePrices.vue'
</script>

<template>
  <div class="container">
    <h1>Цены</h1>
    <TablePrices class="table" />

    <div class="additional-info">
      <h1>Дополнительно</h1>
      <h2>
        Одноступенчатое холодное восстановление перед горячей процедурой (в день процедуры):<br />1500-2500&nbsp;Р
      </h2>
      <p>
        Укрепляет волос изнутри, питает и увлажняет.<br />
        Продлевает срок действия эффекта кератина / ботокса.<br />
        Длительность 30-40 минут.
      </p>
      <h2>Пилинг кожи головы (в день основной процедуры): 1500&nbsp;Р</h2>
      <p>
        Очищает кожу головы от накопившегося сала, ороговевших клеток, стимулирует рост волос.<br />
        Длительность 30 минут.
      </p>
      <h2>
        Диагностика кожи головы трихоскопом, пилинг + увлажнение волос (отдельная процедура):
        2500&nbsp;Р
      </h2>
      <p>
        Подравнивание кончиков - в подарок!<br />
        Длительность 1,5-2 часа.
      </p>
      <h1>На какую процедуру записаться?</h1>
      <p>
        Вам не нужно заранее выбирать процедуру!<br />
        Не подбираю процедуру по фото волос!<br />
        Вы просто записываетесь на процедуру и уже на месте:<br />
        - я провожу консультацию, выслушиваю ваши пожелания, узнаю, что именно вы хотите изменить в
        своих волосах;<br />
        - провожу диагностику волос на степень повреждения и определяю какие процедуры подходят
        вашим волосам;<br />
        - исходя из состояния волос и ваших потребностей, подберу вам максимально подходящую
        процедуру и состав;<br />
        - проконсультирую вас по дальнейшему уходу за волосами, порекомендую домашний уход,
        подходящий имено вашим волосам и коже головы.
      </p>
      <h1 id="title-promo">Срез концов после каждой процедуры в подарок!</h1>
    </div>
  </div>
</template>

<style>
.container {
  margin: 0 auto;
  max-width: 1100px;
  padding: 0 20px;
}

.table {
  margin: 15px auto 0;
}

.additional-info h1 {
  margin-top: 15px;
}

.additional-info h2 {
  margin-top: 15px;
}

.additional-info p {
  margin-top: 5px;
}

#title-promo {
  margin: 15px 0 30px;
}

@media (max-width: 768px) {
  .additional-info h1 {
    line-height: 1.2;
  }

  .additional-info h2 {
    line-height: 1.3;
  }
}
</style>
